# Data Cleaning

In [1]:
# import libraries
import pandas as pd
from datasets import load_dataset
import matplotlib.pyplot as plt

# load data
dataset = load_dataset('lukebarousse/data_jobs')
df = dataset['train'].to_pandas()

# data cleanup
df['job_posted_date'] = pd.to_datetime(df['job_posted_date'])

In [22]:
df.loc[:10, 'salary_year_avg':'salary_hour_avg']

    salary_year_avg  salary_hour_avg
0          115000.0            45.98
1          115000.0            45.98
2          115000.0            45.98
3          115000.0            45.98
4          115000.0            45.98
5          115000.0            45.98
6          115000.0            45.98
7          115000.0            45.98
8          115000.0            45.98
9          115000.0            45.98
10         115000.0            45.98

In [ ]:
# to fill out NaN values of salary_year_avg
median_salary_year_avg = df['salary_year_avg'].median()

In [ ]:
# to fill out NaN values of salary_hour_avg
median_salary_hour_avg = df['salary_hour_avg'].median()

In [ ]:
# df_filled is duplicate of original df
# in case of mistake, original dataset isn't affected
df_filled = df

# replace NaN values in salary_year_avg & salary_hour_avg
df_filled['salary_year_avg'] = df_filled['salary_year_avg'].fillna(median_salary_year_avg)
df_filled['salary_hour_avg'] = df_filled['salary_hour_avg'].fillna(median_salary_hour_avg)

In [20]:
df_filled[['salary_year_avg', 'salary_hour_avg']]

        salary_year_avg  salary_hour_avg
0              115000.0            45.98
1              115000.0            45.98
2              115000.0            45.98
3              115000.0            45.98
4              115000.0            45.98
...                 ...              ...
785736         115000.0            45.98
785737         115000.0            45.98
785738         115000.0            45.98
785739         115000.0            45.98
785740         115000.0            45.98

[785741 rows x 2 columns]

In [ ]:
# dataframe for duplicate values derives values from df_filled dataframe
df_unique = df_filled

# drop duplicates
df_unique = df_unique.drop_duplicates()

# compares original df with dropped-duplicate df
print('Length of original df:        ', len(df_filled))
print('Length of drop duplicates df: ', len(df_unique))
print('Rows dropped:                 ', len(df_filled) - len(df_unique))

Length of original df:         785741
Length of drop duplicates df:  785640
Rows dropped:                  101

In [27]:
# drops duplicate job postings from same company
df_unique = df_unique.drop_duplicates(subset = ['job_title', 'company_name'])

print('Length of original df:        ', len(df_filled))
print('Length of drop duplicates df: ', len(df_unique))
print('Rows dropped:                 ', len(df_filled) - len(df_unique))

Length of original df:         785741
Length of drop duplicates df:  508042
Rows dropped:                  277699